zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC5536JHI48-pinctrl.h
#undef DMA1_TRIG19_PIO0_25
#undef DMA1_TRIG19_PIO0_28
#undef DMA1_TRIG19_PIO0_31
#undef DMA1_TRIG19_PIO1_10
#undef DMA1_TRIG19_PIO1_12
#undef DMA1_TRIG19_PIO1_13
#undef DMA1_TRIG19_PIO1_14
#undef DMA1_TRIG19_PIO1_15
#undef DMA1_TRIG19_PIO1_16
#undef DMA1_TRIG19_PIO1_17
#undef DMA1_TRIG19_PIO1_18
#undef DMA1_TRIG19_PIO1_19
#undef DMA1_TRIG19_PIO1_20
#undef DMA1_TRIG19_PIO1_21
#undef DMA1_TRIG19_PIO1_22
#undef DMA1_TRIG19_PIO1_23
#undef DMA1_TRIG19_PIO1_24
#undef DMA1_TRIG19_PIO1_25
#undef DMA1_TRIG19_PIO1_26
#undef DMA1_TRIG19_PIO1_27
#undef DMA1_TRIG19_PIO1_28
#undef DMA1_TRIG19_PIO1_29
#undef DMA1_TRIG19_PIO1_30
#undef DMA1_TRIG19_PIO1_31
#undef DMA1_TRIG19_PIO1_4
#undef DMA1_TRIG19_PIO1_5
#undef DMA1_TRIG19_PIO1_6
#undef DMA1_TRIG19_PIO1_7
#undef DMA1_TRIG19_PIO1_8
#undef DMA1_TRIG19_PIO1_9
#undef ENC0_PHASEA_PIO0_22
#undef ENC0_PHASEA_PIO0_25
#undef ENC0_PHASEA_PIO1_12
#undef ENC0_PHASEA_PIO1_14
#undef ENC0_PHASEA_PIO1_15
#undef ENC0_PHASEA_PIO1_16
#undef ENC0_PHASEA_PIO1_29
#undef ENC0_PHASEA_PIO1_31
#undef ENC0_PHASEA_PIO1_4
#undef ENC0_PHASEB_PIO0_22
#undef ENC0_PHASEB_PIO0_25
#undef ENC0_PHASEB_PIO1_12
#undef ENC0_PHASEB_PIO1_14
#undef ENC0_PHASEB_PIO1_15
#undef ENC0_PHASEB_PIO1_16
#undef ENC0_PHASEB_PIO1_29
#undef ENC0_PHASEB_PIO1_31
#undef ENC0_PHASEB_PIO1_4
#undef ENC1_PHASEA_PIO0_22
#undef ENC1_PHASEA_PIO0_25
#undef ENC1_PHASEA_PIO1_12
#undef ENC1_PHASEA_PIO1_14
#undef ENC1_PHASEA_PIO1_15
#undef ENC1_PHASEA_PIO1_16
#undef ENC1_PHASEA_PIO1_29
#undef ENC1_PHASEA_PIO1_31
#undef ENC1_PHASEA_PIO1_4
#undef ENC1_PHASEB_PIO0_22
#undef ENC1_PHASEB_PIO0_25
#undef ENC1_PHASEB_PIO1_12
#undef ENC1_PHASEB_PIO1_14
#undef ENC1_PHASEB_PIO1_15
#undef ENC1_PHASEB_PIO1_16
#undef ENC1_PHASEB_PIO1_29
#undef ENC1_PHASEB_PIO1_31
#undef ENC1_PHASEB_PIO1_4
#undef EXTTRIG_IN2_PIO1_31
#undef EXTTRIG_IN5_PIO0_22
#undef EXTTRIG_IN6_PIO0_25
#undef EXTTRIG_IN7_PIO1_16
#undef EXTTRIG_IN8_PIO1_15
#undef EXTTRIG_IN8_PIO1_4
#undef EXTTRIG_IN9_PIO1_12
#undef EXTTRIG_IN9_PIO1_14
#undef EXTTRIG_IN9_PIO1_29
#undef FC0_CTS_SDA_SSEL0_PIO0_23
#undef FC0_CTS_SDA_SSEL0_PIO0_31
#undef FC0_CTS_SDA_SSEL0_PIO1_8
#undef FC0_RTS_SCL_SSEL1_PIO1_7
#undef FC0_RXD_SDA_MOSI_DATA_PIO1_5
#undef FC0_RXD_SDA_MOSI_DATA_PIO2_0
#undef FC0_SCK_PIO0_28
#undef FC0_SCK_PIO1_4
#undef FC0_TXD_SCL_MISO_WS_PIO0_25
#undef FC0_TXD_SCL_MISO_WS_PIO1_6
#undef FC1_RXD_SDA_MOSI_DATA_PIO1_10
#undef FC1_RXD_SDA_MOSI_DATA_PIO1_16
#undef FC1_SCK_PIO1_15
#undef FC1_SCK_PIO1_8
#undef FC1_SCK_PIO1_9
#undef FC2_CTS_SDA_SSEL0_PIO1_26
#undef FC2_RTS_SCL_SSEL1_PIO1_27
#undef FC2_RXD_SDA_MOSI_DATA_PIO1_24
#undef FC2_SCK_PIO1_23
#undef FC2_TXD_SCL_MISO_WS_PIO1_25
#undef FC3_SSEL2_PIO1_23
#undef FC3_SSEL3_PIO1_24
#undef FC3_TXD_SCL_MISO_WS_PIO0_12
#undef FC4_CTS_SDA_SSEL0_PIO1_9
#undef FC4_RTS_SCL_SSEL1_PIO1_15
#undef FC4_RXD_SDA_MOSI_DATA_PIO1_21
#undef FC4_SCK_PIO1_19
#undef FC4_SSEL2_PIO1_8
#undef FC4_SSEL3_PIO1_22
#undef FC4_TXD_SCL_MISO_WS_PIO1_20
#undef FC4_TXD_SCL_MISO_WS_PIO1_4
#undef FC5_CTS_SDA_SSEL0_PIO1_14
#undef FC5_RTS_SCL_SSEL1_PIO1_15
#undef FC6_RTS_SCL_SSEL1_PIO1_17
#undef FC6_RXD_SDA_MOSI_DATA_PIO1_13
#undef FC6_SCK_PIO1_12
#undef FC6_TXD_SCL_MISO_WS_PIO0_12
#undef FC6_TXD_SCL_MISO_WS_PIO0_22
#undef FC6_TXD_SCL_MISO_WS_PIO1_16
#undef FC7_CTS_SDA_SSEL0_PIO1_21
#undef FC7_RTS_SCL_SSEL1_PIO0_22
#undef FC7_RTS_SCL_SSEL1_PIO1_20
#undef FC7_RXD_SDA_MOSI_DATA_PIO1_29
#undef FC7_SCK_PIO1_28
#undef FC7_TXD_SCL_MISO_WS_PIO1_30
#undef FLEXSPI0_DATA4_PIO1_16
#undef FLEXSPI0_DATA5_PIO1_15
#undef FLEXSPI0_DATA6_PIO1_27
#undef FLEXSPI0_DATA7_PIO1_29
#undef FLEXSPI0_DQS_PIO0_25
#undef FLEXSPI0_SCLK_N_PIO0_22
#undef FLEXSPI0_SS1_N_PIO0_22
#undef GPIO_PIO012_PIO0_12
#undef GPIO_PIO022_PIO0_22
#undef GPIO_PIO023_PIO0_23
#undef GPIO_PIO025_PIO0_25
#undef GPIO_PIO028_PIO0_28
#undef GPIO_PIO031_PIO0_31
#undef GPIO_PIO110_PIO1_10
#undef GPIO_PIO112_PIO1_12
#undef GPIO_PIO113_PIO1_13
#undef GPIO_PIO114_PIO1_14
#undef GPIO_PIO115_PIO1_15
#undef GPIO_PIO116_PIO1_16
#undef GPIO_PIO117_PIO1_17
#undef GPIO_PIO118_PIO1_18
#undef GPIO_PIO119_PIO1_19
#undef GPIO_PIO120_PIO1_20
#undef GPIO_PIO121_PIO1_21
#undef GPIO_PIO122_PIO1_22
#undef GPIO_PIO123_PIO1_23
#undef GPIO_PIO124_PIO1_24
#undef GPIO_PIO125_PIO1_25
#undef GPIO_PIO126_PIO1_26
#undef GPIO_PIO127_PIO1_27
#undef GPIO_PIO128_PIO1_28
#undef GPIO_PIO129_PIO1_29
#undef GPIO_PIO130_PIO1_30
#undef GPIO_PIO131_PIO1_31
#undef GPIO_PIO14_PIO1_4
#undef GPIO_PIO15_PIO1_5
#undef GPIO_PIO16_PIO1_6
#undef GPIO_PIO17_PIO1_7
#undef GPIO_PIO18_PIO1_8
#undef GPIO_PIO19_PIO1_9
#undef GPIO_PIO20_PIO2_0
#undef HSCMP0_IN1_PIO1_12
#undef HSCMP0_IN3_PIO1_5
#undef HSCMP0_IN4_PIO1_9
#undef HSCMP0_OUT_PIO0_25
#undef HSCMP0_OUT_PIO1_30
#undef HSCMP0_OUT_PIO1_6
#undef HSCMP1_IN1_PIO1_22
#undef HSCMP1_IN3_PIO1_10
#undef HSCMP1_IN5_PIO1_19
#undef HSCMP1_OUT_PIO1_28
#undef HSCMP2_IN1_PIO1_23
#undef HSCMP2_OUT_PIO1_10
#undef HSCMP2_OUT_PIO1_18
#undef HS_SPI_SSEL2_PIO1_12
#undef HS_SPI_SSEL3_PIO1_26
#undef I3C0_PUR_PIO0_28
#undef I3C0_PUR_PIO2_0
#undef MCLK_PIO0_23
#undef MCLK_PIO1_31
#undef OPAMP0_OUT_PIO1_9
#undef PINT_PINT0_PIO0_12
#undef PINT_PINT0_PIO0_22
#undef PINT_PINT0_PIO0_23
#undef PINT_PINT0_PIO0_25
#undef PINT_PINT0_PIO0_28
#undef PINT_PINT0_PIO0_31
#undef PINT_PINT0_PIO1_10
#undef PINT_PINT0_PIO1_12
#undef PINT_PINT0_PIO1_13
#undef PINT_PINT0_PIO1_14
#undef PINT_PINT0_PIO1_15
#undef PINT_PINT0_PIO1_16
#undef PINT_PINT0_PIO1_17
#undef PINT_PINT0_PIO1_18
#undef PINT_PINT0_PIO1_19
#undef PINT_PINT0_PIO1_20
#undef PINT_PINT0_PIO1_21
#undef PINT_PINT0_PIO1_22
#undef PINT_PINT0_PIO1_23
#undef PINT_PINT0_PIO1_24
#undef PINT_PINT0_PIO1_25
#undef PINT_PINT0_PIO1_26
#undef PINT_PINT0_PIO1_27
#undef PINT_PINT0_PIO1_28
#undef PINT_PINT0_PIO1_29
#undef PINT_PINT0_PIO1_30
#undef PINT_PINT0_PIO1_31
#undef PINT_PINT0_PIO1_4
#undef PINT_PINT0_PIO1_5
#undef PINT_PINT0_PIO1_6
#undef PINT_PINT0_PIO1_7
#undef PINT_PINT0_PIO1_8
#undef PINT_PINT0_PIO1_9
#undef PINT_PINT1_PIO0_12
#undef PINT_PINT1_PIO0_22
#undef PINT_PINT1_PIO0_23
#undef PINT_PINT1_PIO0_25
#undef PINT_PINT1_PIO0_28
#undef PINT_PINT1_PIO0_31
#undef PINT_PINT1_PIO1_10
#undef PINT_PINT1_PIO1_12
#undef PINT_PINT1_PIO1_13
#undef PINT_PINT1_PIO1_14
#undef PINT_PINT1_PIO1_15
#undef PINT_PINT1_PIO1_16
#undef PINT_PINT1_PIO1_17
#undef PINT_PINT1_PIO1_18
#undef PINT_PINT1_PIO1_19
#undef PINT_PINT1_PIO1_20
#undef PINT_PINT1_PIO1_21
#undef PINT_PINT1_PIO1_22
#undef PINT_PINT1_PIO1_23
#undef PINT_PINT1_PIO1_24
#undef PINT_PINT1_PIO1_25
#undef PINT_PINT1_PIO1_26
#undef PINT_PINT1_PIO1_27
#undef PINT_PINT1_PIO1_28
#undef PINT_PINT1_PIO1_29
#undef PINT_PINT1_PIO1_30
#undef PINT_PINT1_PIO1_31
#undef PINT_PINT1_PIO1_4
#undef PINT_PINT1_PIO1_5
#undef PINT_PINT1_PIO1_6
#undef PINT_PINT1_PIO1_7
#undef PINT_PINT1_PIO1_8
#undef PINT_PINT1_PIO1_9
#undef PINT_PINT2_PIO0_12
#undef PINT_PINT2_PIO0_22
#undef PINT_PINT2_PIO0_23
#undef PINT_PINT2_PIO0_25
#undef PINT_PINT2_PIO0_28
#undef PINT_PINT2_PIO0_31
#undef PINT_PINT2_PIO1_10
#undef PINT_PINT2_PIO1_12
#undef PINT_PINT2_PIO1_13
#undef PINT_PINT2_PIO1_14
#undef PINT_PINT2_PIO1_15
#undef PINT_PINT2_PIO1_16
#undef PINT_PINT2_PIO1_17
#undef PINT_PINT2_PIO1_18
#undef PINT_PINT2_PIO1_19
#undef PINT_PINT2_PIO1_20
#undef PINT_PINT2_PIO1_21
#undef PINT_PINT2_PIO1_22
#undef PINT_PINT2_PIO1_23
#undef PINT_PINT2_PIO1_24
#undef PINT_PINT2_PIO1_25
#undef PINT_PINT2_PIO1_26
#undef PINT_PINT2_PIO1_27
#undef PINT_PINT2_PIO1_28
#undef PINT_PINT2_PIO1_29
#undef PINT_PINT2_PIO1_30
#undef PINT_PINT2_PIO1_31
#undef PINT_PINT2_PIO1_4
#undef PINT_PINT2_PIO1_5
#undef PINT_PINT2_PIO1_6
#undef PINT_PINT2_PIO1_7
#undef PINT_PINT2_PIO1_8
#undef PINT_PINT2_PIO1_9
#undef PINT_PINT3_PIO0_12
#undef PINT_PINT3_PIO0_22
#undef PINT_PINT3_PIO0_23
#undef PINT_PINT3_PIO0_25
#undef PINT_PINT3_PIO0_28
#undef PINT_PINT3_PIO0_31
#undef PINT_PINT3_PIO1_10
#undef PINT_PINT3_PIO1_12
#undef PINT_PINT3_PIO1_13
#undef PINT_PINT3_PIO1_14
#undef PINT_PINT3_PIO1_15
#undef PINT_PINT3_PIO1_16
#undef PINT_PINT3_PIO1_17
#undef PINT_PINT3_PIO1_18
#undef PINT_PINT3_PIO1_19
#undef PINT_PINT3_PIO1_20
#undef PINT_PINT3_PIO1_21
#undef PINT_PINT3_PIO1_22
#undef PINT_PINT3_PIO1_23
#undef PINT_PINT3_PIO1_24
#undef PINT_PINT3_PIO1_25
#undef PINT_PINT3_PIO1_26
#undef PINT_PINT3_PIO1_27
#undef PINT_PINT3_PIO1_28
#undef PINT_PINT3_PIO1_29
#undef PINT_PINT3_PIO1_30
#undef PINT_PINT3_PIO1_31
#undef PINT_PINT3_PIO1_4
#undef PINT_PINT3_PIO1_5
#undef PINT_PINT3_PIO1_6
#undef PINT_PINT3_PIO1_7
#undef PINT_PINT3_PIO1_8
#undef PINT_PINT3_PIO1_9
#undef PINT_PINT4_PIO0_12
#undef PINT_PINT4_PIO0_22
#undef PINT_PINT4_PIO0_23
#undef PINT_PINT4_PIO0_25
#undef PINT_PINT4_PIO0_28
#undef PINT_PINT4_PIO0_31
#undef PINT_PINT4_PIO1_10
#undef PINT_PINT4_PIO1_12
#undef PINT_PINT4_PIO1_13
#undef PINT_PINT4_PIO1_14
#undef PINT_PINT4_PIO1_15
#undef PINT_PINT4_PIO1_16
#undef PINT_PINT4_PIO1_17
#undef PINT_PINT4_PIO1_18
#undef PINT_PINT4_PIO1_19
#undef PINT_PINT4_PIO1_20
#undef PINT_PINT4_PIO1_21
#undef PINT_PINT4_PIO1_22
#undef PINT_PINT4_PIO1_23
#undef PINT_PINT4_PIO1_24
#undef PINT_PINT4_PIO1_25
#undef PINT_PINT4_PIO1_26
#undef PINT_PINT4_PIO1_27
#undef PINT_PINT4_PIO1_28
#undef PINT_PINT4_PIO1_29
#undef PINT_PINT4_PIO1_30
#undef PINT_PINT4_PIO1_31
#undef PINT_PINT4_PIO1_4
#undef PINT_PINT4_PIO1_5
#undef PINT_PINT4_PIO1_6
#undef PINT_PINT4_PIO1_7
#undef PINT_PINT4_PIO1_8
#undef PINT_PINT4_PIO1_9
#undef PINT_PINT5_PIO0_12
#undef PINT_PINT5_PIO0_22
#undef PINT_PINT5_PIO0_23
#undef PINT_PINT5_PIO0_25
#undef PINT_PINT5_PIO0_28
#undef PINT_PINT5_PIO0_31
#undef PINT_PINT5_PIO1_10
#undef PINT_PINT5_PIO1_12
#undef PINT_PINT5_PIO1_13
#undef PINT_PINT5_PIO1_14
#undef PINT_PINT5_PIO1_15
#undef PINT_PINT5_PIO1_16
#undef PINT_PINT5_PIO1_17
#undef PINT_PINT5_PIO1_18
#undef PINT_PINT5_PIO1_19
#undef PINT_PINT5_PIO1_20
#undef PINT_PINT5_PIO1_21
#undef PINT_PINT5_PIO1_22
#undef PINT_PINT5_PIO1_23
#undef PINT_PINT5_PIO1_24
#undef PINT_PINT5_PIO1_25
#undef PINT_PINT5_PIO1_26
#undef PINT_PINT5_PIO1_27
#undef PINT_PINT5_PIO1_28
#undef PINT_PINT5_PIO1_29
#undef PINT_PINT5_PIO1_30
#undef PINT_PINT5_PIO1_31
#undef PINT_PINT5_PIO1_4
#undef PINT_PINT5_PIO1_5
#undef PINT_PINT5_PIO1_6
#undef PINT_PINT5_PIO1_7
#undef PINT_PINT5_PIO1_8
#undef PINT_PINT5_PIO1_9
#undef PINT_PINT6_PIO0_12
#undef PINT_PINT6_PIO0_22
#undef PINT_PINT6_PIO0_23
#undef PINT_PINT6_PIO0_25
#undef PINT_PINT6_PIO0_28
#undef PINT_PINT6_PIO0_31
#undef PINT_PINT6_PIO1_10
#undef PINT_PINT6_PIO1_12
#undef PINT_PINT6_PIO1_13
#undef PINT_PINT6_PIO1_14
#undef PINT_PINT6_PIO1_15
#undef PINT_PINT6_PIO1_16
#undef PINT_PINT6_PIO1_17
#undef PINT_PINT6_PIO1_18
#undef PINT_PINT6_PIO1_19
#undef PINT_PINT6_PIO1_20
#undef PINT_PINT6_PIO1_21
#undef PINT_PINT6_PIO1_22
#undef PINT_PINT6_PIO1_23
#undef PINT_PINT6_PIO1_24
#undef PINT_PINT6_PIO1_25
#undef PINT_PINT6_PIO1_26
#undef PINT_PINT6_PIO1_27
#undef PINT_PINT6_PIO1_28
#undef PINT_PINT6_PIO1_29
#undef PINT_PINT6_PIO1_30
#undef PINT_PINT6_PIO1_31
#undef PINT_PINT6_PIO1_4
#undef PINT_PINT6_PIO1_5
#undef PINT_PINT6_PIO1_6
#undef PINT_PINT6_PIO1_7
#undef PINT_PINT6_PIO1_8
#undef PINT_PINT6_PIO1_9
#undef PINT_PINT7_PIO0_12
#undef PINT_PINT7_PIO0_22
#undef PINT_PINT7_PIO0_23
#undef PINT_PINT7_PIO0_25
#undef PINT_PINT7_PIO0_28
#undef PINT_PINT7_PIO0_31
#undef PINT_PINT7_PIO1_10
#undef PINT_PINT7_PIO1_12
#undef PINT_PINT7_PIO1_13
#undef PINT_PINT7_PIO1_14
#undef PINT_PINT7_PIO1_15
#undef PINT_PINT7_PIO1_16
#undef PINT_PINT7_PIO1_17
#undef PINT_PINT7_PIO1_18
#undef PINT_PINT7_PIO1_19
#undef PINT_PINT7_PIO1_20
#undef PINT_PINT7_PIO1_21
#undef PINT_PINT7_PIO1_22
#undef PINT_PINT7_PIO1_23
#undef PINT_PINT7_PIO1_24
#undef PINT_PINT7_PIO1_25
#undef PINT_PINT7_PIO1_26
#undef PINT_PINT7_PIO1_27
#undef PINT_PINT7_PIO1_28
#undef PINT_PINT7_PIO1_29
#undef PINT_PINT7_PIO1_30
#undef PINT_PINT7_PIO1_31
#undef PINT_PINT7_PIO1_4
#undef PINT_PINT7_PIO1_5
#undef PINT_PINT7_PIO1_6
#undef PINT_PINT7_PIO1_7
#undef PINT_PINT7_PIO1_8
#undef PINT_PINT7_PIO1_9
#undef PIO0_12_PIO0_12_PIO0_12
#undef PIO0_22_PIO0_22_PIO0_22
#undef PIO0_23_PIO0_23_PIO0_23
#undef PIO0_25_PIO0_25_PIO0_25
#undef PIO0_28_PIO0_28_PIO0_28
#undef PIO0_31_PIO0_31_PIO0_31
#undef PIO1_10_PIO1_10_PIO1_10
#undef PIO1_12_PIO1_12_PIO1_12
#undef PIO1_13_PIO1_13_PIO1_13
#undef PIO1_14_PIO1_14_PIO1_14
#undef PIO1_15_PIO1_15_PIO1_15
#undef PIO1_16_PIO1_16_PIO1_16
#undef PIO1_17_PIO1_17_PIO1_17
#undef PIO1_18_PIO1_18_PIO1_18
#undef PIO1_19_PIO1_19_PIO1_19
#undef PIO1_20_PIO1_20_PIO1_20
#undef PIO1_21_PIO1_21_PIO1_21
#undef PIO1_22_PIO1_22_PIO1_22
#undef PIO1_23_PIO1_23_PIO1_23
#undef PIO1_24_PIO1_24_PIO1_24
#undef PIO1_25_PIO1_25_PIO1_25
#undef PIO1_26_PIO1_26_PIO1_26
#undef PIO1_27_PIO1_27_PIO1_27
#undef PIO1_28_PIO1_28_PIO1_28
#undef PIO1_29_PIO1_29_PIO1_29
#undef PIO1_30_PIO1_30_PIO1_30
#undef PIO1_31_PIO1_31_PIO1_31
#undef PIO1_4_PIO1_4_PIO1_4
#undef PIO1_5_PIO1_5_PIO1_5
#undef PIO1_6_PIO1_6_PIO1_6
#undef PIO1_7_PIO1_7_PIO1_7
#undef PIO1_8_PIO1_8_PIO1_8
#undef PIO1_9_PIO1_9_PIO1_9
#undef PMC_ACMP_IN4_PIO1_14
#undef PWM0_A0_PIO0_25
#undef PWM0_A0_PIO1_20
#undef PWM0_A1_PIO1_26
#undef PWM0_A1_PIO1_6
#undef PWM0_A2_PIO0_28
#undef PWM0_A2_PIO1_18
#undef PWM0_A2_PIO1_8
#undef PWM0_A3_PIO1_12
#undef PWM0_B0_PIO1_15
#undef PWM0_B0_PIO1_17
#undef PWM0_B1_PIO1_22
#undef PWM0_B2_PIO1_16
#undef PWM0_B2_PIO1_4
#undef PWM0_B3_PIO1_14
#undef PWM0_EXTA0_PIO0_22
#undef PWM0_EXTA0_PIO0_25
#undef PWM0_EXTA0_PIO1_12
#undef PWM0_EXTA0_PIO1_14
#undef PWM0_EXTA0_PIO1_15
#undef PWM0_EXTA0_PIO1_16
#undef PWM0_EXTA0_PIO1_29
#undef PWM0_EXTA0_PIO1_31
#undef PWM0_EXTA0_PIO1_4
#undef PWM0_EXTA1_PIO0_22
#undef PWM0_EXTA1_PIO0_25
#undef PWM0_EXTA1_PIO1_12
#undef PWM0_EXTA1_PIO1_14
#undef PWM0_EXTA1_PIO1_15
#undef PWM0_EXTA1_PIO1_16
#undef PWM0_EXTA1_PIO1_29
#undef PWM0_EXTA1_PIO1_31
#undef PWM0_EXTA1_PIO1_4
#undef PWM0_EXTA2_PIO0_22
#undef PWM0_EXTA2_PIO0_25
#undef PWM0_EXTA2_PIO1_12
#undef PWM0_EXTA2_PIO1_14
#undef PWM0_EXTA2_PIO1_15
#undef PWM0_EXTA2_PIO1_16
#undef PWM0_EXTA2_PIO1_29
#undef PWM0_EXTA2_PIO1_31
#undef PWM0_EXTA2_PIO1_4
#undef PWM0_EXTA3_PIO0_22
#undef PWM0_EXTA3_PIO0_25
#undef PWM0_EXTA3_PIO1_12
#undef PWM0_EXTA3_PIO1_14
#undef PWM0_EXTA3_PIO1_15
#undef PWM0_EXTA3_PIO1_16
#undef PWM0_EXTA3_PIO1_29
#undef PWM0_EXTA3_PIO1_31
#undef PWM0_EXTA3_PIO1_4
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO0_22
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO0_25
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO1_12
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO1_14
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO1_15
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO1_16
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO1_29
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO1_31
#undef PWM0_PWM_EXSYNC_TRG_CH0_PIO1_4
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO0_22
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO0_25
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO1_12
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO1_14
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO1_15
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO1_16
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO1_29
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO1_31
#undef PWM0_PWM_EXSYNC_TRG_CH1_PIO1_4
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO0_22
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO0_25
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO1_12
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO1_14
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO1_15
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO1_16
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO1_29
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO1_31
#undef PWM0_PWM_EXSYNC_TRG_CH2_PIO1_4
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO0_22
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO0_25
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO1_12
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO1_14
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO1_15
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO1_16
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO1_29
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO1_31
#undef PWM0_PWM_EXSYNC_TRG_CH3_PIO1_4
#undef PWM0_PWM_FAULT_TRG_CH0_PIO0_22
#undef PWM0_PWM_FAULT_TRG_CH0_PIO0_25
#undef PWM0_PWM_FAULT_TRG_CH0_PIO1_12
#undef PWM0_PWM_FAULT_TRG_CH0_PIO1_14
#undef PWM0_PWM_FAULT_TRG_CH0_PIO1_15
#undef PWM0_PWM_FAULT_TRG_CH0_PIO1_16
#undef PWM0_PWM_FAULT_TRG_CH0_PIO1_29
#undef PWM0_PWM_FAULT_TRG_CH0_PIO1_31
#undef PWM0_PWM_FAULT_TRG_CH0_PIO1_4
#undef PWM0_PWM_FAULT_TRG_CH1_PIO0_22
#undef PWM0_PWM_FAULT_TRG_CH1_PIO0_25
#undef PWM0_PWM_FAULT_TRG_CH1_PIO1_12
#undef PWM0_PWM_FAULT_TRG_CH1_PIO1_14
#undef PWM0_PWM_FAULT_TRG_CH1_PIO1_15
#undef PWM0_PWM_FAULT_TRG_CH1_PIO1_16
#undef PWM0_PWM_FAULT_TRG_CH1_PIO1_29
#undef PWM0_PWM_FAULT_TRG_CH1_PIO1_31
#undef PWM0_PWM_FAULT_TRG_CH1_PIO1_4
#undef PWM0_PWM_FAULT_TRG_CH2_PIO0_22
#undef PWM0_PWM_FAULT_TRG_CH2_PIO0_25
#undef PWM0_PWM_FAULT_TRG_CH2_PIO1_12
#undef PWM0_PWM_FAULT_TRG_CH2_PIO1_14
#undef PWM0_PWM_FAULT_TRG_CH2_PIO1_15
#undef PWM0_PWM_FAULT_TRG_CH2_PIO1_16
#undef PWM0_PWM_FAULT_TRG_CH2_PIO1_29
#undef PWM0_PWM_FAULT_TRG_CH2_PIO1_31
#undef PWM0_PWM_FAULT_TRG_CH2_PIO1_4
#undef PWM0_PWM_FAULT_TRG_CH3_PIO0_22
#undef PWM0_PWM_FAULT_TRG_CH3_PIO0_25
#undef PWM0_PWM_FAULT_TRG_CH3_PIO1_12
#undef PWM0_PWM_FAULT_TRG_CH3_PIO1_14
#undef PWM0_PWM_FAULT_TRG_CH3_PIO1_15
#undef PWM0_PWM_FAULT_TRG_CH3_PIO1_16
#undef PWM0_PWM_FAULT_TRG_CH3_PIO1_29
#undef PWM0_PWM_FAULT_TRG_CH3_PIO1_31
#undef PWM0_PWM_FAULT_TRG_CH3_PIO1_4
#undef PWM0_X1_PIO1_10
#undef PWM0_X2_PIO1_29
#undef PWM0_X3_PIO1_30
#undef PWM1_A0_PIO1_21
#undef PWM1_A1_PIO1_23
#undef PWM1_A2_PIO1_25
#undef PWM1_A3_PIO1_5
#undef PWM1_B2_PIO1_27
#undef PWM1_B2_PIO1_31
#undef PWM1_EXTA0_PIO0_22
#undef PWM1_EXTA0_PIO0_25
#undef PWM1_EXTA0_PIO1_12
#undef PWM1_EXTA0_PIO1_14
#undef PWM1_EXTA0_PIO1_15
#undef PWM1_EXTA0_PIO1_16
#undef PWM1_EXTA0_PIO1_29
#undef PWM1_EXTA0_PIO1_31
#undef PWM1_EXTA0_PIO1_4
#undef PWM1_EXTA1_PIO0_22
#undef PWM1_EXTA1_PIO0_25
#undef PWM1_EXTA1_PIO1_12
#undef PWM1_EXTA1_PIO1_14
#undef PWM1_EXTA1_PIO1_15
#undef PWM1_EXTA1_PIO1_16
#undef PWM1_EXTA1_PIO1_29
#undef PWM1_EXTA1_PIO1_31
#undef PWM1_EXTA1_PIO1_4
#undef PWM1_EXTA2_PIO0_22
#undef PWM1_EXTA2_PIO0_25
#undef PWM1_EXTA2_PIO1_12
#undef PWM1_EXTA2_PIO1_14
#undef PWM1_EXTA2_PIO1_15
#undef PWM1_EXTA2_PIO1_16
#undef PWM1_EXTA2_PIO1_29
#undef PWM1_EXTA2_PIO1_31
#undef PWM1_EXTA2_PIO1_4
#undef PWM1_EXTA3_PIO0_22
#undef PWM1_EXTA3_PIO0_25
#undef PWM1_EXTA3_PIO1_12
#undef PWM1_EXTA3_PIO1_14
#undef PWM1_EXTA3_PIO1_15
#undef PWM1_EXTA3_PIO1_16
#undef PWM1_EXTA3_PIO1_29
#undef PWM1_EXTA3_PIO1_31
#undef PWM1_EXTA3_PIO1_4
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO0_22
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO0_25
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO1_12
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO1_14
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO1_15
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO1_16
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO1_29
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO1_31
#undef PWM1_PWM_EXSYNC_TRG_CH0_PIO1_4
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO0_22
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO0_25
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO1_12
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO1_14
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO1_15
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO1_16
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO1_29
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO1_31
#undef PWM1_PWM_EXSYNC_TRG_CH1_PIO1_4
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO0_22
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO0_25
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO1_12
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO1_14
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO1_15
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO1_16
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO1_29
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO1_31
#undef PWM1_PWM_EXSYNC_TRG_CH2_PIO1_4
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO0_22
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO0_25
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO1_12
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO1_14
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO1_15
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO1_16
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO1_29
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO1_31
#undef PWM1_PWM_EXSYNC_TRG_CH3_PIO1_4
#undef PWM1_PWM_FAULT_TRG_CH0_PIO0_22
#undef PWM1_PWM_FAULT_TRG_CH0_PIO0_25
#undef PWM1_PWM_FAULT_TRG_CH0_PIO1_12
#undef PWM1_PWM_FAULT_TRG_CH0_PIO1_14
#undef PWM1_PWM_FAULT_TRG_CH0_PIO1_15
#undef PWM1_PWM_FAULT_TRG_CH0_PIO1_16
#undef PWM1_PWM_FAULT_TRG_CH0_PIO1_29
#undef PWM1_PWM_FAULT_TRG_CH0_PIO1_31
#undef PWM1_PWM_FAULT_TRG_CH0_PIO1_4
#undef PWM1_PWM_FAULT_TRG_CH1_PIO0_22
#undef PWM1_PWM_FAULT_TRG_CH1_PIO0_25
#undef PWM1_PWM_FAULT_TRG_CH1_PIO1_12
#undef PWM1_PWM_FAULT_TRG_CH1_PIO1_14
#undef PWM1_PWM_FAULT_TRG_CH1_PIO1_15
#undef PWM1_PWM_FAULT_TRG_CH1_PIO1_16
#undef PWM1_PWM_FAULT_TRG_CH1_PIO1_29
#undef PWM1_PWM_FAULT_TRG_CH1_PIO1_31
#undef PWM1_PWM_FAULT_TRG_CH1_PIO1_4
#undef PWM1_PWM_FAULT_TRG_CH2_PIO0_22
#undef PWM1_PWM_FAULT_TRG_CH2_PIO0_25
#undef PWM1_PWM_FAULT_TRG_CH2_PIO1_12
#undef PWM1_PWM_FAULT_TRG_CH2_PIO1_14
#undef PWM1_PWM_FAULT_TRG_CH2_PIO1_15
#undef PWM1_PWM_FAULT_TRG_CH2_PIO1_16
#undef PWM1_PWM_FAULT_TRG_CH2_PIO1_29
#undef PWM1_PWM_FAULT_TRG_CH2_PIO1_31
#undef PWM1_PWM_FAULT_TRG_CH2_PIO1_4
#undef PWM1_PWM_FAULT_TRG_CH3_PIO0_22
#undef PWM1_PWM_FAULT_TRG_CH3_PIO0_25
#undef PWM1_PWM_FAULT_TRG_CH3_PIO1_12
#undef PWM1_PWM_FAULT_TRG_CH3_PIO1_14
#undef PWM1_PWM_FAULT_TRG_CH3_PIO1_15
#undef PWM1_PWM_FAULT_TRG_CH3_PIO1_16
#undef PWM1_PWM_FAULT_TRG_CH3_PIO1_29
#undef PWM1_PWM_FAULT_TRG_CH3_PIO1_31
#undef PWM1_PWM_FAULT_TRG_CH3_PIO1_4
#undef PWM1_X0_PIO0_22
#undef PWM1_X1_PIO1_13
#undef PWM1_X3_PIO1_28
#undef QSPI_CS0_DIS_PIO0_28
#undef QSPI_CS0_DIS_PIO1_15
#undef QSPI_CS0_PIO0_7
#undef QSPI_CS0_PIO1_30
#undef QSPI_CS1_DIS_PIO1_16
#undef QSPI_CS1_DIS_PIO1_26
#undef QSPI_DIN0_PIO1_14
#undef QSPI_DIN0_PIO1_19
#undef QSPI_DIN1_PIO0_18
#undef QSPI_DIN2_PIO1_13
#undef QSPI_DIN3_PIO1_18
#undef QSPI_DIN3_PIO1_22
#undef QSPI_SCLK_PIO0_17
#undef QSPI_SCLK_PIO1_12
#undef RTC_ALARMOUT_PIO1_18
#undef RTC_TAMPER1_PIO0_28
#undef RTC_TAMPER3_PIO1_18
#undef SCT0_IN0_PIO0_12
#undef SCT0_IN0_PIO0_25
#undef SCT0_IN0_PIO1_19
#undef SCT0_IN0_PIO1_22
#undef SCT0_IN0_PIO1_29
#undef SCT0_IN0_PIO1_30
#undef SCT0_IN0_PIO1_5
#undef SCT0_IN0_PIO1_6
#undef SCT0_IN0_PIO1_7
#undef SCT0_IN1_PIO0_12
#undef SCT0_IN1_PIO0_25
#undef SCT0_IN1_PIO1_19
#undef SCT0_IN1_PIO1_22
#undef SCT0_IN1_PIO1_29
#undef SCT0_IN1_PIO1_30
#undef SCT0_IN1_PIO1_5
#undef SCT0_IN1_PIO1_6
#undef SCT0_IN1_PIO1_7
#undef SCT0_IN2_PIO0_12
#undef SCT0_IN2_PIO0_25
#undef SCT0_IN2_PIO1_19
#undef SCT0_IN2_PIO1_22
#undef SCT0_IN2_PIO1_29
#undef SCT0_IN2_PIO1_30
#undef SCT0_IN2_PIO1_5
#undef SCT0_IN2_PIO1_6
#undef SCT0_IN2_PIO1_7
#undef SCT0_IN3_PIO0_12
#undef SCT0_IN3_PIO0_25
#undef SCT0_IN3_PIO1_19
#undef SCT0_IN3_PIO1_22
#undef SCT0_IN3_PIO1_29
#undef SCT0_IN3_PIO1_30
#undef SCT0_IN3_PIO1_5
#undef SCT0_IN3_PIO1_6
#undef SCT0_IN3_PIO1_7
#undef SCT0_IN4_PIO0_12
#undef SCT0_IN4_PIO0_25
#undef SCT0_IN4_PIO1_19
#undef SCT0_IN4_PIO1_22
#undef SCT0_IN4_PIO1_29
#undef SCT0_IN4_PIO1_30
#undef SCT0_IN4_PIO1_5
#undef SCT0_IN4_PIO1_6
#undef SCT0_IN4_PIO1_7
#undef SCT0_IN5_PIO0_12
#undef SCT0_IN5_PIO0_25
#undef SCT0_IN5_PIO1_19
#undef SCT0_IN5_PIO1_22
#undef SCT0_IN5_PIO1_29
#undef SCT0_IN5_PIO1_30
#undef SCT0_IN5_PIO1_5
#undef SCT0_IN5_PIO1_6
#undef SCT0_IN5_PIO1_7
#undef SCT0_IN6_PIO0_12
#undef SCT0_IN6_PIO0_25
#undef SCT0_IN6_PIO1_19
#undef SCT0_IN6_PIO1_22
#undef SCT0_IN6_PIO1_29
#undef SCT0_IN6_PIO1_30
#undef SCT0_IN6_PIO1_5
#undef SCT0_IN6_PIO1_6
#undef SCT0_IN6_PIO1_7
#undef SCT0_OUT0_PIO1_23
#undef SCT0_OUT0_PIO1_4
#undef SCT0_OUT1_PIO1_24
#undef SCT0_OUT1_PIO1_8
#undef SCT0_OUT2_PIO1_25
#undef SCT0_OUT2_PIO1_9
#undef SCT0_OUT3_PIO0_22
#undef SCT0_OUT3_PIO0_31
#undef SCT0_OUT3_PIO1_10
#undef SCT0_OUT3_PIO1_26
#undef SCT0_OUT4_PIO0_23
#undef SCT0_OUT4_PIO1_17
#undef SCT0_OUT5_PIO1_18
#undef SCT0_OUT6_PIO1_31
#undef SCT0_OUT7_PIO0_28
#undef SCT0_OUT7_PIO1_19
#undef SCT0_OUT8_PIO1_13
#undef SECGPIO_SECPIO012_PIO0_12
#undef SECGPIO_SECPIO022_PIO0_22
#undef SECGPIO_SECPIO023_PIO0_23
#undef SECGPIO_SECPIO025_PIO0_25
#undef SECGPIO_SECPIO028_PIO0_28
#undef SECGPIO_SECPIO031_PIO0_31
#undef SECPINT_SECPINT0_PIO0_12
#undef SECPINT_SECPINT0_PIO0_22
#undef SECPINT_SECPINT0_PIO0_23
#undef SECPINT_SECPINT0_PIO0_25
#undef SECPINT_SECPINT0_PIO0_28
#undef SECPINT_SECPINT0_PIO0_31
#undef SECPINT_SECPINT1_PIO0_12
#undef SECPINT_SECPINT1_PIO0_22
#undef SECPINT_SECPINT1_PIO0_23
#undef SECPINT_SECPINT1_PIO0_25
#undef SECPINT_SECPINT1_PIO0_28
#undef SECPINT_SECPINT1_PIO0_31
#undef SPI_CS0_DIS_PIO0_24
#undef SPI_CS0_PIO0_20
#undef SPI_CS1_DIS_PIO0_27
#undef SPI_CS1_DIS_PIO1_28
#undef SPI_DIN_PIO0_29
#undef SPI_DIN_PIO1_4
#undef SPI_SCLK_PIO1_11
#undef SPI_SCLK_PIO1_25
#undef SWD_TRACEDATA3_PIO0_28
#undef SYSCON_FREQMEA_PIO0_11
#undef SYSCON_FREQMEA_PIO1_4
#undef SYSCON_FREQMEB_PIO0_12
#undef USB0_FRAME_PIO1_13
#undef USB0_IDVALUE_PIO0_26
#undef USB0_LEDN_PIO1_14
#undef USB0_OVERCURRENTN_PIO0_28
#undef USB0_OVERCURRENTN_PIO1_13
#undef USB0_PORTPWRN_PIO1_12
#undef USB0_PORTPWRN_PIO1_3
#undef USB0_VBUS_PIO0_22
#undef USB0_VBUS_PIO1_11
#undef USB0_VBUS_PIO1_31
#undef UTICK0_CAPTURE0_PIO1_25
#undef UTICK0_CAPTURE1_PIO0_22
#undef UTICK0_CAPTURE1_PIO1_26
#undef UTICK0_CAPTURE2_PIO1_14
#undef UTICK0_CAPTURE3_PIO1_15

/* Signals with different mux data on this part */
#undef PWM0_B2_PIO1_1
#define PWM0_B2_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 11)
#undef RTC_ALARMOUT_PIO1_1
#define RTC_ALARMOUT_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 10)

/* Signals specific to this part */
#define FREQME_FREQMEA_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 3)

#endif /* _ZEPHYR_DTS_BINDING_LPC5536JHI48_WRAPPER_ */
